from voicy import Google

google = Google(token="token")

print(
    google.tts(
        text="أوجه الحاجة إلى الإبداع"
             " للإبداع أهمية كبيرة في حياة الإنسان والمجتمع، فهو يحقق العديد من الفوائد، منها: التقدم العلمي والتكنولوجي: يُعد الإبداع محرك التقدم العلمي والتكنولوجي، حيث يساهم في إيجاد حلول جديدة للمشكلات التي تواجه البشرية، كما أنه يؤدي إلى اكتشاف تقنيات جديدة تحسن من جودة الحياة. الازدهار الاقتصادي: يُساهم الإبداع في الازدهار الاقتصادي، حيث يؤدي إلى خلق فرص عمل جديدة وزيادة الإنتاجية، كما أنه يجذب الاستثمارات الأجنبية. التنمية الاجتماعية: يُساهم الإبداع في التنمية الاجتماعية، حيث يؤدي إلى زيادة الوعي الثقافي والفني لدى الأفراد، كما أنه يساهم في حل المشكلات الاجتماعية. السعادة والرفاهية: يُساهم الإبداع في تحقيق السعادة والرفاهية للأفراد، حيث أنه يُمكنهم من التعبير عن أنفسهم وتحقيق ذاتهم، كما أنه يُساعدهم على اكتشاف العالم من حولهم بطريقة جديدة ومثيرة. جذور الإبداع في الثقافة الإسلامية تدعو الثقافة الإسلامية إلى الإبداع وتشجعه، حيث تؤكد على أهمية التفكير والتأمل والبحث عن المعرفة، كما أنها تحث على الاجتهاد والابتكار في جميع مجالات الحياة. ومن الأدلة على ذلك ما يلي: حث القرآن الكريم على التفكير والتأمل: قال تعالى: (أَفَلَمْ يَنْظُرُوا إِلَى السَّمَاءِ فَوْقَهُمْ كَيْفَ بَنَيْنَاهَا وَزَيَّنَّاهَا وَمَا لَهَا مِنْ فُرُوجٍ) (سورة ق: الآية 6). حث القرآن الكريم على الاجتهاد والابتكار: قال تعالى: (وَابْتَغِ فِيمَا آتَاكَ اللهَ الدَّارَ الْآخِرَةَ وَلَا تَنسَ نَصِيبَكَ مِنَ الدُّنْيَا وَأَحْسِنْ كَمَا أَحْسَنَ اللهَ إِلَيْكَ وَلَا تَبْغِ الْفَسَادَ فِي الْأَرْضِ إِنَّ اللهَ لَا يُحِبُّ الْمُفْسِدِينَ) (سورة القصص: الآية 77). تكريم العلماء والمبدعين في السنة النبوية: جاء في الحديث الشريف: (من يرد الله به خيرًا يفقهه في الدين) (رواه البخاري). تشجيع المسلمين على التعلم والبحث عن المعرفة: جاء في الحديث الشريف: (طلب العلم فريضة على كل مسلم) (رواه ابن ماجه). وهكذا، فإن الثقافة الإسلامية تُعدّ أرضًا خصبة للإبداع، حيث تُشجعه وتدعمه وتُوفر له الفرص المناسبة للنمو والازدهار.",
        voice={"ar-XA": "ar-XA-Wavenet-C"},
        format="mp3",
        pitch=-6.0,
        rate=1,
    )
)
